Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.hooks.kimi.secondaryUninstallWarning
source: Warning: cmux could not remove its hook block from %@. Check that path and re-run `cmux hooks uninstall kimi` to finish cleanup.
ar: تحذير: تعذّر على cmux إزالة كتلة الخطافات من %@. تحقّق من هذا المسار وأعد تشغيل `cmux hooks uninstall kimi` لإكمال التنظيف.
bs: Upozorenje: cmux nije mogao ukloniti svoj blok hookova iz %@. Provjerite tu putanju i ponovo pokrenite `cmux hooks uninstall kimi` da dovršite čišćenje.
da: Advarsel: cmux kunne ikke fjerne sin hook-blok fra %@. Tjek den sti, og kør `cmux hooks uninstall kimi` igen for at fuldføre oprydningen.
de: Warnung: cmux konnte seinen Hook-Block nicht aus %@ entfernen. Prüfe diesen Pfad und führe `cmux hooks uninstall kimi` erneut aus, um die Bereinigung abzuschließen.
es: Advertencia: cmux no pudo eliminar su bloque de hooks de %@. Revisa esa ruta y vuelve a ejecutar `cmux hooks uninstall kimi` para completar la limpieza.
fr: Avertissement : cmux n'a pas pu supprimer son bloc de hooks de %@. Vérifiez ce chemin et relancez `cmux hooks uninstall kimi` pour terminer le nettoyage.
it: Avviso: cmux non è riuscito a rimuovere il proprio blocco di hook da %@. Controlla quel percorso ed esegui di nuovo `cmux hooks uninstall kimi` per completare la pulizia.
ja: 警告: hook ブロックを %@ から削除できませんでした。そのパスを確認し、`cmux hooks uninstall kimi` を再実行してクリーンアップを完了してください。
ko: 경고: %@에서 hook 블록을 제거하지 못했습니다. 해당 경로를 확인한 뒤 `cmux hooks uninstall kimi`를 다시 실행해 정리를 완료하세요.
nb: Advarsel: cmux kunne ikke fjerne hook-blokken sin fra %@. Sjekk den banen og kjør `cmux hooks uninstall kimi` på nytt for å fullføre oppryddingen.
pl: Ostrzeżenie: cmux nie mógł usunąć swojego bloku hooków z %@. Sprawdź tę ścieżkę i uruchom ponownie `cmux hooks uninstall kimi`, aby dokończyć czyszczenie.
pt_br: Aviso: o cmux não conseguiu remover seu bloco de hooks de %@. Verifique esse caminho e execute `cmux hooks uninstall kimi` novamente para concluir a limpeza.
ru: Предупреждение: cmux не смог удалить свой блок хуков из %@. Проверьте этот путь и запустите `cmux hooks uninstall kimi` ещё раз, чтобы завершить очистку.
th: คำเตือน: cmux ไม่สามารถลบบล็อก hook ออกจาก %@ ได้ ตรวจสอบพาธนั้นแล้วรัน `cmux hooks uninstall kimi` อีกครั้งเพื่อทำความสะอาดให้เสร็จสมบูรณ์
tr: Uyarı: cmux, hook bloğunu %@ konumundan kaldıramadı. Bu yolu kontrol edin ve temizliği tamamlamak için `cmux hooks uninstall kimi` komutunu yeniden çalıştırın.
uk: Попередження: cmux не зміг видалити свій блок хуків із %@. Перевірте цей шлях і запустіть `cmux hooks uninstall kimi` ще раз, щоб завершити очищення.
zh_hans: 警告：cmux 无法从 %@ 中移除其 hook 块。请检查该路径，然后重新运行 `cmux hooks uninstall kimi` 以完成清理。
zh_hant: 警告：cmux 無法從 %@ 移除其 hook 區塊。請檢查該路徑，然後重新執行 `cmux hooks uninstall kimi` 以完成清理。

# cli.hooks.kiro.postInstallNote
source: Kiro applies these hooks only when run as the cmux agent. Start Kiro with `kiro-cli chat --agent cmux`, or make it the default with `kiro-cli settings chat.defaultAgent cmux`.
ar: يطبق Kiro هذه الخطافات فقط عند تشغيله كوكيل لـ cmux. ابدأ Kiro باستخدام `kiro-cli chat --agent cmux`، أو اجعله الافتراضي باستخدام `kiro-cli settings chat.defaultAgent cmux`.
de: Kiro wendet diese Hooks nur an, wenn es als cmux-Agent ausgeführt wird. Starten Sie Kiro mit `kiro-cli chat --agent cmux` oder machen Sie es mit `kiro-cli settings chat.defaultAgent cmux` zum Standard.
es: Kiro aplica estos hooks solo cuando se ejecuta como el agente de cmux. Inicie Kiro con `kiro-cli chat --agent cmux`, o conviértalo en el valor predeterminado con `kiro-cli settings chat.defaultAgent cmux`.
fr: Kiro applique ces hooks uniquement lorsqu'il est exécuté en tant qu'agent cmux. Démarrez Kiro avec `kiro-cli chat --agent cmux` ou définissez-le par défaut avec `kiro-cli settings chat.defaultAgent cmux`.
ja: Kiroフックはcmuxエージェントとして実行した場合のみ適用されます。Kiroを`kiro-cli chat --agent cmux`で起動するか、`kiro-cli settings chat.defaultAgent cmux`でデフォルトに設定してください。
ko: Kiro 훅은 cmux 에이전트로 실행할 때만 적용됩니다. `kiro-cli chat --agent cmux`로 Kiro를 실행하거나 `kiro-cli settings chat.defaultAgent cmux`로 기본값으로 설정하세요.
zh_hans: Kiro 仅在以 cmux agent 身份运行时应用这些 hooks。请用 `kiro-cli chat --agent cmux` 启动 Kiro，或用 `kiro-cli settings chat.defaultAgent cmux` 将其设为默认。
zh_hant: Kiro 僅在作為 cmux 代理程式執行時才套用這些勾點。請使用 `kiro-cli chat --agent cmux` 啟動 Kiro，或使用 `kiro-cli settings chat.defaultAgent cmux` 將其設為預設值。

# cli.hooks.omp.aborted
source: Aborted.
ar: أُلغيَت العملية.
bs: Prekinuto.
da: Afbrudt.
de: Abgebrochen.
es: Operación cancelada.
fr: Opération annulée.
it: Operazione annullata.
ja: 中止しました。
ko: 중단했습니다.
nb: Avbrutt.
pl: Przerwano.
pt_br: Abortado.
ru: Операция прервана.
th: ยกเลิกแล้ว
tr: İptal edildi.
uk: Операцію скасовано.
zh_hans: 已中止。
zh_hant: 已中止。

# cli.hooks.omp.alreadyUpToDate
source: OMP hooks already up to date at %@
ar: خطافات OMP محدَّثة بالفعل في %@
bs: OMP hookovi su već ažurirani u %@
da: OMP-hooks er allerede opdaterede i %@
de: OMP-Hooks sind in %@ bereits auf dem neuesten Stand
es: Los hooks de OMP ya están actualizados en %@
fr: Les hooks OMP sont déjà à jour dans %@
it: Gli hook di OMP sono già aggiornati in %@
ja: %@ の OMP フックはすでに最新です
ko: %@의 OMP 훅은 이미 최신 상태입니다
nb: OMP-hooks er allerede oppdatert i %@
pl: Hooki OMP są już aktualne w %@
pt_br: Os hooks do OMP já estão atualizados em %@
ru: Хуки OMP в %@ уже актуальны
th: ฮุก OMP ที่ %@ เป็นเวอร์ชันล่าสุดอยู่แล้ว
tr: OMP kancaları %@ konumunda zaten güncel
uk: Хуки OMP у %@ вже актуальні
zh_hans: %@ 中的 OMP hooks 已是最新
zh_hant: %@ 中的 OMP hooks 已是最新

# cli.hooks.omp.confirmProceed
source: Proceed? [y/N]
ar: هل تريد المتابعة؟ [y/N]
bs: Nastaviti? [y/N]
da: Fortsæt? [y/N]
de: Fortfahren? [y/N]
es: ¿Continuar? [y/N]
fr: Continuer ? [y/N]
it: Procedere? [y/N]
ja: 続行しますか？ [y/N]
ko: 계속하시겠습니까? [y/N]
nb: Fortsette? [y/N]
pl: Kontynuować? [y/N]
pt_br: Prosseguir? [y/N]
ru: Продолжить? [y/N]
th: ดำเนินการต่อหรือไม่? [y/N]
tr: Devam edilsin mi? [y/N]
uk: Продовжити? [y/N]
zh_hans: 是否继续？ [y/N]
zh_hant: 是否繼續？ [y/N]

# cli.hooks.omp.error.notCmuxExtension
source: %@ exists and is not a cmux extension; leaving it alone
ar: %@ موجود وليس امتداد cmux؛ سيتم تركه كما هو
bs: %@ postoji i nije cmux ekstenzija; ostavljam ga netaknutim
da: %@ findes og er ikke en cmux-udvidelse; lader den være
de: %@ existiert und ist keine cmux-Erweiterung; wird unverändert belassen
es: %@ existe y no es una extensión de cmux; se dejará intacto
fr: %@ existe et n’est pas une extension cmux ; aucun changement n’y sera apporté
it: %@ esiste e non è un'estensione cmux; verrà lasciato invariato
ja: %@ は存在しますが cmux 拡張ではありません。そのままにします
ko: %@이(가) 존재하지만 cmux 확장이 아니므로 그대로 둡니다
nb: %@ finnes og er ikke en cmux-utvidelse; lar den være i fred
pl: %@ istnieje i nie jest rozszerzeniem cmux; pozostawiam bez zmian
pt_br: %@ existe e não é uma extensão do cmux; será deixado como está
ru: %@ существует и не является расширением cmux; оставляем без изменений
th: %@ มีอยู่แล้วและไม่ใช่ส่วนขยาย cmux; จะปล่อยไว้ตามเดิม
tr: %@ mevcut ve bir cmux uzantısı değil; olduğu gibi bırakılıyor
uk: %@ існує і не є розширенням cmux; залишаємо без змін
zh_hans: %@ 已存在且不是 cmux 扩展；将保持不变
zh_hant: %@ 已存在且不是 cmux 擴充功能；將維持原樣

# cli.hooks.omp.error.readFailed
source: Failed to read %@
ar: فشل في قراءة %@
bs: Čitanje %@ nije uspjelo
da: Kunne ikke læse %@
de: Fehler beim Lesen von %@
es: No se pudo leer %@
fr: Échec de la lecture de %@
it: Impossibile leggere %@
ja: %@ の読み取りに失敗しました
ko: %@을(를) 읽지 못했습니다
nb: Klarte ikke å lese %@
pl: Nie udało się odczytać %@
pt_br: Falha ao ler %@
ru: Не удалось прочитать %@
th: อ่าน %@ ไม่สำเร็จ
tr: %@ okunamadı
uk: Не вдалося прочитати %@
zh_hans: 读取 %@ 失败
zh_hant: 讀取 %@ 失敗

# cli.hooks.omp.installed
source: OMP hooks installed at %@
ar: تم تثبيت خطافات OMP في %@
bs: OMP hookovi su instalirani u %@
da: OMP-hooks er installeret i %@
de: OMP-Hooks wurden in %@ installiert
es: Hooks de OMP instalados en %@
fr: Hooks OMP installés dans %@
it: Hook di OMP installati in %@
ja: OMP フックを %@ にインストールしました
ko: %@에 OMP 훅을 설치했습니다
nb: OMP-hooks er installert i %@
pl: Zainstalowano hooki OMP w %@
pt_br: Hooks do OMP instalados em %@
ru: Хуки OMP установлены в %@
th: ติดตั้งฮุก OMP ที่ %@ แล้ว
tr: OMP kancaları %@ konumuna kuruldu
uk: Хуки OMP встановлено в %@
zh_hans: 已在 %@ 安装 OMP hooks
zh_hant: 已在 %@ 安裝 OMP hooks

# cli.hooks.omp.noneFound
source: No OMP cmux extension found at %@
ar: لم يتم العثور على امتداد OMP cmux في %@
bs: Nijedna OMP cmux ekstenzija nije pronađena u %@
da: Ingen OMP cmux-udvidelse fundet i %@
de: Keine OMP-cmux-Erweiterung in %@ gefunden
es: No se encontró ninguna extensión OMP cmux en %@
fr: Aucune extension OMP cmux trouvée dans %@
it: Nessuna estensione OMP cmux trovata in %@
ja: %@ に OMP cmux 拡張が見つかりません
ko: %@에서 OMP cmux 확장을 찾을 수 없습니다
nb: Fant ingen OMP cmux-utvidelse i %@
pl: Nie znaleziono rozszerzenia OMP cmux w %@
pt_br: Nenhuma extensão OMP cmux encontrada em %@
ru: Расширение OMP cmux в %@ не найдено
th: ไม่พบส่วนขยาย OMP cmux ที่ %@
tr: %@ konumunda OMP cmux uzantısı bulunamadı
uk: Розширення OMP cmux у %@ не знайдено
zh_hans: 未在 %@ 找到 OMP cmux 扩展
zh_hant: 未在 %@ 找到 OMP cmux 擴充功能

# cli.hooks.omp.refuseRemoveMissingMarker
source: Refusing to remove %@: missing cmux marker
ar: تم رفض إزالة %@: علامة cmux مفقودة
bs: Odbijam uklanjanje %@: nedostaje cmux oznaka
da: Nægter at fjerne %@: manglende cmux-markør
de: %@ wird nicht entfernt: cmux-Markierung fehlt
es: Se rechaza eliminar %@: falta el marcador de cmux
fr: Suppression de %@ refusée : marqueur cmux manquant
it: Rimozione di %@ rifiutata: marcatore cmux mancante
ja: %@ の削除を拒否しました: cmux マーカーがありません
ko: %@ 삭제를 거부합니다: cmux 마커가 없습니다
nb: Nekter å fjerne %@: manglende cmux-markør
pl: Odmowa usunięcia %@: brak znacznika cmux
pt_br: Recusando remover %@: marcador do cmux ausente
ru: Отказ в удалении %@: отсутствует маркер cmux
th: ปฏิเสธที่จะลบ %@: ไม่มีเครื่องหมาย cmux
tr: %@ kaldırılmayı reddediliyor: cmux işareti eksik
uk: Відмовлено у видаленні %@: відсутній маркер cmux
zh_hans: 拒绝移除 %@：缺少 cmux 标记
zh_hant: 拒絕移除 %@：缺少 cmux 標記

# cli.hooks.omp.removed
source: Removed OMP cmux extension from %@
ar: تمت إزالة امتداد OMP cmux من %@
bs: OMP cmux ekstenzija je uklonjena iz %@
da: OMP cmux-udvidelse blev fjernet fra %@
de: OMP-cmux-Erweiterung aus %@ entfernt
es: Se eliminó la extensión OMP cmux de %@
fr: Extension OMP cmux supprimée de %@
it: Estensione OMP cmux rimossa da %@
ja: %@ から OMP cmux 拡張を削除しました
ko: %@에서 OMP cmux 확장을 제거했습니다
nb: Fjernet OMP cmux-utvidelse fra %@
pl: Usunięto rozszerzenie OMP cmux z %@
pt_br: Extensão OMP cmux removida de %@
ru: Расширение OMP cmux удалено из %@
th: ลบส่วนขยาย OMP cmux ออกจาก %@ แล้ว
tr: OMP cmux uzantısı %@ konumundan kaldırıldı
uk: Розширення OMP cmux видалено з %@
zh_hans: 已从 %@ 移除 OMP cmux 扩展
zh_hant: 已從 %@ 移除 OMP cmux 擴充功能

# cli.hooks.pi.aborted
source: Aborted.
ar: أُلغيَت العملية.
bs: Prekinuto.
da: Afbrudt.
de: Abgebrochen.
es: Operación cancelada.
fr: Opération annulée.
it: Operazione annullata.
ja: 中止しました。
ko: 중단했습니다.
nb: Avbrutt.
pl: Przerwano.
pt_br: Abortado.
ru: Операция прервана.
th: ยกเลิกแล้ว
tr: İptal edildi.
uk: Операцію скасовано.
zh_hans: 已中止。
zh_hant: 已中止。

# cli.hooks.pi.alreadyUpToDate
source: Pi hooks already up to date at %@
ar: خطافات Pi محدَّثة بالفعل في %@
bs: Pi hookovi su već ažurirani u %@
da: Pi-hooks er allerede opdaterede i %@
de: Pi-Hooks sind in %@ bereits auf dem neuesten Stand
es: Los hooks de Pi ya están actualizados en %@
fr: Les hooks Pi sont déjà à jour dans %@
it: Gli hook di Pi sono già aggiornati in %@
ja: %@ の Pi フックはすでに最新です
ko: %@의 Pi 훅은 이미 최신 상태입니다
nb: Pi-hooks er allerede oppdatert i %@
pl: Hooki Pi są już aktualne w %@
pt_br: Os hooks do Pi já estão atualizados em %@
ru: Хуки Pi в %@ уже актуальны
th: ฮุก Pi ที่ %@ เป็นเวอร์ชันล่าสุดอยู่แล้ว
tr: Pi kancaları %@ konumunda zaten güncel
uk: Хуки Pi у %@ вже актуальні
zh_hans: %@ 中的 Pi hooks 已是最新
zh_hant: %@ 中的 Pi hooks 已是最新

# cli.hooks.pi.confirmProceed
source: Proceed? [y/N]
ar: هل تريد المتابعة؟ [y/N]
bs: Nastaviti? [y/N]
da: Fortsæt? [y/N]
de: Fortfahren? [y/N]
es: ¿Continuar? [y/N]
fr: Continuer ? [y/N]
it: Procedere? [y/N]
ja: 続行しますか？ [y/N]
ko: 계속하시겠습니까? [y/N]
nb: Fortsette? [y/N]
pl: Kontynuować? [y/N]
pt_br: Prosseguir? [y/N]
ru: Продолжить? [y/N]
th: ดำเนินการต่อหรือไม่? [y/N]
tr: Devam edilsin mi? [y/N]
uk: Продовжити? [y/N]
zh_hans: 是否继续？ [y/N]
zh_hant: 是否繼續？ [y/N]

# cli.hooks.pi.error.feedIngestionNotAcknowledged
source: cmux did not receive acknowledgment for Pi feed ingestion
ar: لم يتلقَّ cmux تأكيدًا لاستيعاب موجز Pi
de: cmux hat keine Bestätigung für die Pi-Feed-Aufnahme erhalten
es: cmux no recibió confirmación para la ingesta del feed de Pi
fr: cmux n'a pas reçu d'accusé de réception pour l'ingestion du flux Pi
ja: cmux が Pi フィードの取り込み確認を受信できませんでした
ko: cmux가 Pi 피드 수집에 대한 수신 확인(acknowledgment)을 받지 못했습니다.
zh_hans: cmux 未收到 Pi feed 摄取的确认
zh_hant: cmux 未收到 Pi 動態擷取的確認

# cli.hooks.pi.error.notCmuxExtension
source: %@ exists and is not a cmux extension; leaving it alone
ar: %@ موجود وليس امتداد cmux؛ سيتم تركه كما هو
bs: %@ postoji i nije cmux ekstenzija; ostavljam ga netaknutim
da: %@ findes og er ikke en cmux-udvidelse; lader den være
de: %@ existiert und ist keine cmux-Erweiterung; wird unverändert belassen
es: %@ existe y no es una extensión de cmux; se dejará intacto
fr: %@ existe et n’est pas une extension cmux ; aucun changement n’y sera apporté
it: %@ esiste e non è un'estensione cmux; verrà lasciato invariato
ja: %@ は存在しますが cmux 拡張ではありません。そのままにします
ko: %@이(가) 존재하지만 cmux 확장이 아니므로 그대로 둡니다
nb: %@ finnes og er ikke en cmux-utvidelse; lar den være i fred
pl: %@ istnieje i nie jest rozszerzeniem cmux; pozostawiam bez zmian
pt_br: %@ existe e não é uma extensão do cmux; será deixado como está
ru: %@ существует и не является расширением cmux; оставляем без изменений
th: %@ มีอยู่แล้วและไม่ใช่ส่วนขยาย cmux; จะปล่อยไว้ตามเดิม
tr: %@ mevcut ve bir cmux uzantısı değil; olduğu gibi bırakılıyor
uk: %@ існує і не є розширенням cmux; залишаємо без змін
zh_hans: %@ 已存在且不是 cmux 扩展；将保持不变
zh_hant: %@ 已存在且不是 cmux 擴充功能；將維持原樣

# cli.hooks.pi.error.readFailed
source: Failed to read %@
ar: فشل في قراءة %@
bs: Čitanje %@ nije uspjelo
da: Kunne ikke læse %@
de: Fehler beim Lesen von %@
es: No se pudo leer %@
fr: Échec de la lecture de %@
it: Impossibile leggere %@
ja: %@ の読み取りに失敗しました
ko: %@을(를) 읽지 못했습니다
nb: Klarte ikke å lese %@
pl: Nie udało się odczytać %@
pt_br: Falha ao ler %@
ru: Не удалось прочитать %@
th: อ่าน %@ ไม่สำเร็จ
tr: %@ okunamadı
uk: Не вдалося прочитати %@
zh_hans: 读取 %@ 失败
zh_hant: 讀取 %@ 失敗

# cli.hooks.pi.installed
source: Pi hooks installed at %@
ar: تم تثبيت خطافات Pi في %@
bs: Pi hookovi su instalirani u %@
da: Pi-hooks er installeret i %@
de: Pi-Hooks wurden in %@ installiert
es: Hooks de Pi instalados en %@
fr: Hooks Pi installés dans %@
it: Hook di Pi installati in %@
ja: Pi フックを %@ にインストールしました
ko: %@에 Pi 훅을 설치했습니다
nb: Pi-hooks er installert i %@
pl: Zainstalowano hooki Pi w %@
pt_br: Hooks do Pi instalados em %@
ru: Хуки Pi установлены в %@
th: ติดตั้งฮุก Pi ที่ %@ แล้ว
tr: Pi kancaları %@ konumuna kuruldu
uk: Хуки Pi встановлено в %@
zh_hans: 已在 %@ 安装 Pi hooks
zh_hant: 已在 %@ 安裝 Pi hooks

# cli.hooks.pi.noneFound
source: No Pi cmux extension found at %@
ar: لم يتم العثور على امتداد Pi cmux في %@
bs: Nijedna Pi cmux ekstenzija nije pronađena u %@
da: Ingen Pi cmux-udvidelse fundet i %@
de: Keine Pi-cmux-Erweiterung in %@ gefunden
es: No se encontró ninguna extensión Pi cmux en %@
fr: Aucune extension Pi cmux trouvée dans %@
it: Nessuna estensione Pi cmux trovata in %@
ja: %@ に Pi cmux 拡張が見つかりません
ko: %@에서 Pi cmux 확장을 찾을 수 없습니다
nb: Fant ingen Pi cmux-utvidelse i %@
pl: Nie znaleziono rozszerzenia Pi cmux w %@
pt_br: Nenhuma extensão Pi cmux encontrada em %@
ru: Расширение Pi cmux в %@ не найдено
th: ไม่พบส่วนขยาย Pi cmux ที่ %@
tr: %@ konumunda Pi cmux uzantısı bulunamadı
uk: Розширення Pi cmux у %@ не знайдено
zh_hans: 未在 %@ 找到 Pi cmux 扩展
zh_hant: 未在 %@ 找到 Pi cmux 擴充功能

# cli.hooks.pi.refuseRemoveMissingMarker
source: Refusing to remove %@: missing cmux marker
ar: تم رفض إزالة %@: علامة cmux مفقودة
bs: Odbijam uklanjanje %@: nedostaje cmux oznaka
da: Nægter at fjerne %@: manglende cmux-markør
de: %@ wird nicht entfernt: cmux-Markierung fehlt
es: Se rechaza eliminar %@: falta el marcador de cmux
fr: Suppression de %@ refusée : marqueur cmux manquant
it: Rimozione di %@ rifiutata: marcatore cmux mancante
ja: %@ の削除を拒否しました: cmux マーカーがありません
ko: %@ 삭제를 거부합니다: cmux 마커가 없습니다
nb: Nekter å fjerne %@: manglende cmux-markør
pl: Odmowa usunięcia %@: brak znacznika cmux
pt_br: Recusando remover %@: marcador do cmux ausente
ru: Отказ в удалении %@: отсутствует маркер cmux
th: ปฏิเสธที่จะลบ %@: ไม่มีเครื่องหมาย cmux
tr: %@ kaldırılmayı reddediliyor: cmux işareti eksik
uk: Відмовлено у видаленні %@: відсутній маркер cmux
zh_hans: 拒绝移除 %@：缺少 cmux 标记
zh_hant: 拒絕移除 %@：缺少 cmux 標記

# cli.hooks.pi.removed
source: Removed Pi cmux extension from %@
ar: تمت إزالة امتداد Pi cmux من %@
bs: Pi cmux ekstenzija je uklonjena iz %@
da: Pi cmux-udvidelse blev fjernet fra %@
de: Pi-cmux-Erweiterung aus %@ entfernt
es: Se eliminó la extensión Pi cmux de %@
fr: Extension Pi cmux supprimée de %@
it: Estensione Pi cmux rimossa da %@
ja: %@ から Pi cmux 拡張を削除しました
ko: %@에서 Pi cmux 확장을 제거했습니다
nb: Fjernet Pi cmux-utvidelse fra %@
pl: Usunięto rozszerzenie Pi cmux z %@
pt_br: Extensão Pi cmux removida de %@
ru: Расширение Pi cmux удалено из %@
th: ลบส่วนขยาย Pi cmux ออกจาก %@ แล้ว
tr: Pi cmux uzantısı %@ konumundan kaldırıldı
uk: Розширення Pi cmux видалено з %@
zh_hans: 已从 %@ 移除 Pi cmux 扩展
zh_hant: 已從 %@ 移除 Pi cmux 擴充功能

# cli.install.adminRequired
source: Administrator privileges were required to write to /usr/local/bin.
ar: كانت صلاحيات المسؤول مطلوبة للكتابة في /usr/local/bin.
bs: Potrebne su administratorske privilegije za pisanje u /usr/local/bin.
da: Administratorrettigheder var nødvendige for at skrive til /usr/local/bin.
de: Zum Schreiben in /usr/local/bin waren Administratorrechte erforderlich.
es: Se requirieron privilegios de administrador para escribir en /usr/local/bin.
fr: Des privilèges d'administrateur étaient nécessaires pour écrire dans /usr/local/bin.
it: Sono stati richiesti i privilegi di amministratore per scrivere in /usr/local/bin.
ja: /usr/local/binへの書き込みに管理者権限が必要でした。
ko: /usr/local/bin에 기록하기 위해 관리자 권한이 필요합니다.
nb: Administratorrettigheter var nødvendig for å skrive til /usr/local/bin.
pl: Do zapisu w /usr/local/bin wymagane były uprawnienia administratora.
pt_br: Privilégios de administrador foram necessários para gravar em /usr/local/bin.
ru: Для записи в /usr/local/bin потребовались права администратора.
th: ต้องใช้สิทธิ์ผู้ดูแลระบบเพื่อเขียนไปยัง /usr/local/bin
tr: /usr/local/bin dizinine yazmak için yönetici ayrıcalıkları gerekiyordu.
uk: Для запису в /usr/local/bin потрібні права адміністратора.
zh_hans: 写入 /usr/local/bin 需要管理员权限。
zh_hant: 寫入 /usr/local/bin 需要管理者權限。

# cli.install.symlinkCreated
source: Created symlink: %1$@ -> %2$@
ar: تم إنشاء رابط رمزي: %1$@ -> %2$@
bs: Kreirana simbolička veza: %1$@ -> %2$@
da: Symbolsk link oprettet: %1$@ -> %2$@
de: Symbolische Verknüpfung erstellt: %1$@ -> %2$@
es: Enlace simbólico creado: %1$@ -> %2$@
fr: Lien symbolique créé : %1$@ -> %2$@
it: Collegamento simbolico creato: %1$@ -> %2$@
ja: シンボリックリンクを作成しました: %1$@ -> %2$@
ko: 심볼릭 링크 생성 완료: %1$@ -> %2$@
nb: Opprettet symbolsk lenke: %1$@ -> %2$@
pl: Utworzono dowiązanie symboliczne: %1$@ -> %2$@
pt_br: Link simbólico criado: %1$@ -> %2$@
ru: Создана символическая ссылка: %1$@ -> %2$@
th: สร้างลิงก์สัญลักษณ์แล้ว: %1$@ -> %2$@
tr: Sembolik bağ oluşturuldu: %1$@ -> %2$@
uk: Створено символічне посилання: %1$@ -> %2$@
zh_hans: 已创建符号链接： %1$@ -> %2$@
zh_hant: 已建立符號連結： %1$@ -> %2$@

# cli.installFailed
source: Couldn't Install cmux CLI
ar: تعذر تثبيت واجهة أوامر cmux
bs: Nije moguće instalirati cmux CLI
da: Kunne ikke installere cmux CLI
de: cmux CLI konnte nicht installiert werden
es: No se pudo instalar la CLI de cmux
fr: Impossible d'installer la CLI cmux
it: Impossibile installare la CLI di cmux
ja: cmux CLI をインストールできませんでした
ko: cmux CLI를 설치할 수 없습니다
nb: Kunne ikke installere cmux CLI
pl: Nie udało się zainstalować CLI cmux
pt_br: Não Foi Possível Instalar o CLI do cmux
ru: Не удалось установить cmux CLI
th: ไม่สามารถติดตั้ง cmux CLI ได้
tr: cmux CLI Yüklenemedi
uk: Не вдалося встановити cmux CLI
zh_hans: 无法安装 cmux CLI
zh_hant: 無法安裝 cmux CLI

# cli.installed
source: cmux CLI Installed
ar: تم تثبيت واجهة أوامر cmux
bs: cmux CLI instaliran
da: cmux CLI installeret
de: cmux CLI installiert
es: CLI de cmux instalada
fr: CLI cmux installée
it: CLI di cmux installata
ja: cmux CLI がインストールされました
ko: cmux CLI 설치 완료
nb: cmux CLI installert
pl: CLI cmux zainstalowane
pt_br: CLI do cmux Instalado
ru: cmux CLI установлен
th: ติดตั้ง cmux CLI แล้ว
tr: cmux CLI Yüklendi
uk: cmux CLI встановлено
zh_hans: cmux CLI 已安装
zh_hant: cmux CLI 已安裝

# cli.ios.error.ambiguousTargets
source: Found %lld iOS Simulator panes; pass --surface <ref> or --all
ar: تم العثور على %lld جزء لمحاكي iOS؛ مرر --surface <ref> أو --all
de: %lld iOS-Simulator-Teilfenster gefunden; gib --surface <ref> oder --all an
es: Se encontraron %lld paneles del simulador de iOS; pasa --surface <ref> o --all
fr: %lld volets de simulateur iOS trouvés ; passez --surface <ref> ou --all
ja: %lld 個の iOS シミュレータペインが見つかりました。--surface <ref> または --all を指定してください
ko: %lld개의 iOS 시뮬레이터 분할 창을 발견했습니다. --surface <ref> 또는 --all을 전달하세요.
zh_hans: 发现 %lld 个 iOS 模拟器窗格；请传递 --surface <ref> 或 --all
zh_hant: 找到 %lld 個 iOS 模擬器窗格；請加上 --surface <ref> 或 --all

# cli.ios.error.deviceNotFound
source: The requested iOS Simulator device was not found
ar: لم يتم العثور على جهاز محاكي iOS المطلوب
de: Das angeforderte iOS-Simulator-Gerät wurde nicht gefunden
es: No se encontró el dispositivo del simulador de iOS solicitado
fr: L'appareil de Simulateur iOS demandé n'a pas été trouvé
ja: 指定したiOS Simulatorデバイスが見つかりませんでした
ko: 요청한 iOS Simulator 기기를 찾을 수 없습니다.
zh_hans: 未找到请求的 iOS 模拟器设备
zh_hant: 找不到要求的 iOS 模擬器裝置

# cli.ios.error.deviceSelectionFailed
source: The requested iOS Simulator device did not start streaming
ar: لم يبدأ جهاز محاكي iOS المطلوب البث
de: Das angeforderte iOS-Simulator-Gerät hat das Streaming nicht gestartet
es: El dispositivo del simulador de iOS solicitado no inició la transmisión
fr: L'appareil de Simulateur iOS demandé n'a pas démarré la diffusion
ja: 指定したiOS Simulatorデバイスのストリーミングを開始できませんでした
ko: 요청한 iOS Simulator 기기가 스트리밍을 시작하지 못했습니다.
zh_hans: 请求的 iOS 模拟器设备未开始串流
zh_hant: 要求的 iOS 模擬器裝置未開始串流

# cli.ios.error.missingSimulatorID
source: The selected iOS pane has no Simulator identifier
ar: لا يحتوي جزء iOS المحدد على معرف محاكي
de: Das ausgewählte iOS-Teilfenster hat keine Simulator-Kennung
es: El panel de iOS seleccionado no tiene un identificador de simulador
fr: Le volet iOS sélectionné n'a pas d'identifiant de Simulateur
ja: 選択したiOSペインにSimulator識別子がありません
ko: 선택한 iOS 분할 창에 Simulator 식별자가 없습니다.
zh_hans: 所选的 iOS 窗格没有模拟器标识符
zh_hant: 選取的 iOS 窗格沒有模擬器識別碼

# cli.ios.error.missingSurfaceReference
source: The selected iOS pane has no surface reference
ar: لا يحتوي جزء iOS المحدد على مرجع للسطح
de: Das ausgewählte iOS-Teilfenster hat keine Oberflächen-Referenz
es: El panel de iOS seleccionado no tiene referencia de superficie
fr: Le volet iOS sélectionné n'a pas de référence de surface d’affichage
ja: 選択したiOSペインにサーフェス参照がありません
ko: 선택한 iOS 분할 창에 화면 참조가 없습니다.
zh_hans: 所选的 iOS 窗格没有表面引用
zh_hant: 選取的 iOS 窗格沒有介面參考

# cli.ios.error.noTargets
source: No matching iOS Simulator panes were found
ar: لم يتم العثور على أجزاء محاكي iOS مطابقة
de: Es wurden keine passenden iOS-Simulator-Teilfenster gefunden
es: No se encontraron paneles del simulador de iOS coincidentes
fr: Aucun volet de Simulateur iOS correspondant n'a été trouvé
ja: 一致するiOS Simulatorペインが見つかりませんでした
ko: 일치하는 iOS Simulator 분할 창을 찾을 수 없습니다.
zh_hans: 未找到匹配的 iOS 模拟器窗格
zh_hant: 找不到符合的 iOS 模擬器窗格
